docs/2020-01-05-2214 START HERE.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-21 Wed 22:24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>START HERE</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='static/style.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<div id='head'>
    <h1><b>zd-tutorial</b></h1>
    &mdash;
    <ul>
        <li><a href='./2020-02-15-1247 Welcome.html'>Welcome</a></li>
        <li><a href='https://efls.github.io/zetteldeft'
	       style='float: right'>Zetteldeft</a></li>
    </ul>
</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">START HERE</h1>
</header><p>
This is a tutorial for Zetteldeft, a Zettelkasten system on top of Deft.
</p>

<p>
This file guides you through a Zetteldeft installation and basic setup.
</p>

<p>
If you use MELPA and <code>use-package</code>, installing is as easy as:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff; font-weight: bold;">use-package</span> <span style="color: #00bcff;">deft</span>
  <span style="color: #f78fe7; font-weight: bold;">:ensure</span> t
  <span style="color: #f78fe7; font-weight: bold;">:init</span>
    (<span style="color: #b6a0ff; font-weight: bold;">setq</span> deft-extensions '(<span style="color: #79a8ff;">"org"</span> <span style="color: #79a8ff;">"md"</span> <span style="color: #79a8ff;">"txt"</span>)
          deft-use-filename-as-title t))

(<span style="color: #b6a0ff; font-weight: bold;">use-package</span> <span style="color: #00bcff;">zetteldeft</span>
  <span style="color: #f78fe7; font-weight: bold;">:ensure</span> t
  <span style="color: #f78fe7; font-weight: bold;">:after</span> deft
  <span style="color: #f78fe7; font-weight: bold;">:config</span> (zetteldeft-set-classic-keybindings))
</pre>
</div>

<p>
Hit <code>C-c C-c</code> in the code block above to execute the code.
</p>

<p>
This will set up default keybindings behind the <code>C-c d</code> prefix.
If you use <code>evil</code> and <code>leader.el</code>, you might prefer different bindings (see <a href="./2020-02-15-1508 Keybindings with leader.el.html">ยง2020-02-15-1508</a>).
For installation on spacemacs, see <a href="./2020-04-18-1304 Zetteldeft and spacemacs.html">ยง2020-04-18-1304</a>.
</p>

<p>
Next, we need configure some settings.
</p>

<p>
Point <code>deft-dir</code> to the tutorial files (i.e., the current directory)
and tell Deft to refresh:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff; font-weight: bold;">setq</span> deft-directory default-directory)

(deft)
(deft-refresh)
</pre>
</div>

<p>
Make sure you use the default configuration.
If you already use Zetteldeft and have a personal config, override it with the code below.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff; font-weight: bold;">setq</span> zetteldeft-link-indicator <span style="color: #79a8ff;">"&#167;"</span>
      zetteldeft-id-format <span style="color: #79a8ff;">"%Y-%m-%d-%H%M"</span>
      zetteldeft-id-regex <span style="color: #79a8ff;">"[0-9]\\{4\\}</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">(</span><span style="color: #79a8ff;">-[0-9]\\{2,\\}</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">)</span><span style="color: #79a8ff;">\\{3\\}"</span>
      zetteldeft-tag-regex <span style="color: #79a8ff;">"[#@][a-z-]+"</span>)
</pre>
</div>

<p>
Finally, I advise to enable <code>visual-line-mode</code> so that long lines are wrapped at the window&rsquo;s edges.
I use it to write these notes, so you&rsquo;ll need it to read them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(visual-line-mode t)
</pre>
</div>

<p>
For a better reading experience I advise <code>writeroom-mode</code>, but this is not strictly necessary.
</p>

<p>
Now you are ready to move to note <a href="./2020-02-15-1247 Welcome.html">ยง2020-02-15-1247</a>.
</p>

<p>
Hit <code>M-x zetteldeft-follow-link</code> or <code>C-c d f</code>, and pick a link to follow.
</p>
</div>
</body>
</html>
